[Killed] ObjectLiteral
main/components/CourseGradeDist/CourseGradeDistTable.js:18:5
       Header: "Course",
       accessor: "course",
     },
-    {
-      Header: "Instructor",
-      accessor: "instructor",
-    },
+    {},
     {
       Header: "Grade",
killedBy: CourseGradeDistTable tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/CourseGradeDist/CourseGradeDistTable.js:23:15
       accessor: "instructor",
     },
     {
-      Header: "Grade",
+      Header: "",
       accessor: "grade",
     },
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: TestingLibraryElementError: Unable to find an element with the text: Grade. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/CourseGradeDist/CourseGradeDistTable.js:24:17
     },
     {
       Header: "Grade",
-      accessor: "grade",
+      accessor: "",
     },
     {
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseGradeDistTable-cell-row-0-col-grade"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/CourseGradeDist/CourseGradeDistTable.js:32:38
     },
   ];
 
-  for (const gradeDist of gradeData) {
-    const year = gradeDist.yyyyq.slice(0, 4);
-    let quarter;
-    switch (gradeDist.yyyyq[4]) {
-      case "1":
-        quarter = "Winter";
-        break;
-      case "2":
-        quarter = "Spring";
-        break;
-      case "3":
-        quarter = "Summer";
-        break;
-      default:
-        // There should never be a case where its not 1,2,3,4, right..
-        quarter = "Fall";
-    }
-    const session = quarter + " " + year;
-    gradeDist.session = session;
-  }
+  for (const gradeDist of gradeData) {}
 
   return (
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Winter 2023
Received:

[Killed] MethodExpression
main/components/CourseGradeDist/CourseGradeDistTable.js:33:18
   ];
 
   for (const gradeDist of gradeData) {
-    const year = gradeDist.yyyyq.slice(0, 4);
+    const year = gradeDist.yyyyq;
     let quarter;
     switch (gradeDist.yyyyq[4]) {
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  Winter 20231
Received:
  Winter 20231

[Killed] ConditionalExpression
main/components/CourseGradeDist/CourseGradeDistTable.js:36:7
     const year = gradeDist.yyyyq.slice(0, 4);
     let quarter;
     switch (gradeDist.yyyyq[4]) {
-      case "1":
-        quarter = "Winter";
-        break;
+      case "1":
       case "2":
         quarter = "Spring";
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Winter 2023
Received:
  Spring 2023

[Killed] StringLiteral
main/components/CourseGradeDist/CourseGradeDistTable.js:37:19
     let quarter;
     switch (gradeDist.yyyyq[4]) {
       case "1":
-        quarter = "Winter";
+        quarter = "";
         break;
       case "2":
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Winter 2023
Received:
  2023

[Killed] ConditionalExpression
main/components/CourseGradeDist/CourseGradeDistTable.js:39:7
       case "1":
         quarter = "Winter";
         break;
-      case "2":
-        quarter = "Spring";
-        break;
+      case "2":
       case "3":
         quarter = "Summer";
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Spring 2023
Received:
  Summer 2023

[Killed] ConditionalExpression
main/components/CourseGradeDist/CourseGradeDistTable.js:42:7
       case "2":
         quarter = "Spring";
         break;
-      case "3":
-        quarter = "Summer";
-        break;
+      case "3":
       default:
         // There should never be a case where its not 1,2,3,4, right..
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Summer 2023
Received:
  Fall 2023

[Killed] ConditionalExpression
main/components/CourseGradeDist/CourseGradeDistTable.js:45:7
       case "3":
         quarter = "Summer";
         break;
-      default:
-        // There should never be a case where its not 1,2,3,4, right..
-        quarter = "Fall";
+      default:
     }
     const session = quarter + " " + year;
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Fall 2023
Received:
  undefined 2023

[Killed] StringLiteral
main/components/CourseGradeDist/CourseGradeDistTable.js:47:19
         break;
       default:
         // There should never be a case where its not 1,2,3,4, right..
-        quarter = "Fall";
+        quarter = "";
     }
     const session = quarter + " " + year;
killedBy: CourseGradeDistTable tests displays the distribution correctly for 4 data points all with different sessions
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Fall 2023
Received:
  2023
