[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:37:17
     },
     {
       Header: "Enroll Code",
-      accessor: "classSections[0].enrollCode",
+      accessor: "",
     },
     {
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-classSections[0].enrollCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/PersonalSections/PersonalSectionsTable.js:39:5
       Header: "Enroll Code",
       accessor: "classSections[0].enrollCode",
     },
-    {
-      Header: "Section",
-      accessor: "classSections[0].section",
-    },
+    {},
     {
       Header: "Title",
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/PersonalSections/PersonalSectionsTable.js:40:15
       accessor: "classSections[0].enrollCode",
     },
     {
-      Header: "Section",
+      Header: "",
       accessor: "classSections[0].section",
     },
killedBy: PersonalSectionsTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Section. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
