[Killed] BlockStatement
src/main/utils/sectionUtils.js:114:57
   toast(message);
 }
 
-export function cellToAxiosParamsDelete({ cell, psId }) {
-  const enrollCode = cell.row.values["classSections[0].enrollCode"];
-  return {
-    url: "/api/personalSections/delete",
-    method: "DELETE",
-    params: {
-      psId: psId,
-      enrollCd: enrollCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete({ cell, psId }) {}
 
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"enrollCd": "12345", "psId": 1}, "url": "/api/personalSections/delete"}
Received: undefined

[Killed] StringLiteral
src/main/utils/sectionUtils.js:115:38
 }
 
 export function cellToAxiosParamsDelete({ cell, psId }) {
-  const enrollCode = cell.row.values["classSections[0].enrollCode"];
+  const enrollCode = cell.row.values[""];
   return {
     url: "/api/personalSections/delete",
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "method": "DELETE",
    "params": Object {

[Killed] ObjectLiteral
src/main/utils/sectionUtils.js:119:13
   return {
     url: "/api/personalSections/delete",
     method: "DELETE",
-    params: {
-      psId: psId,
-      enrollCd: enrollCode,
-    },
+    params: {},
   };
 }
killedBy: section utils tests cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

  Object {
    "method": "DELETE",
-   "params": Object {
