[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:32:9
     localStorage.setItem(controlId, selectedSchedule);
     setScheduleState(selectedSchedule);
     setSchedule(selectedSchedule);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: PersonalScheduleSelector updates the schedule state, calls setSchedule, and calls onChange when a schedule is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
