[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:12:46
 import { filterSchedulesByQuarter } from "main/utils/PersonalScheduleUtils";
 
 export default function AddToScheduleModal({ quarter, section, onAdd }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [selectedSchedule, setSelectedSchedule] = useState("");
 
killedBy: AddToScheduleModal renders without crashing
statusReason: Error: useHref() may be used only in the context of a <Router> component.

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.js:27:34
   );
   // Stryker restore all
 
-  const handleModalClose = () => {
-    setShowModal(false);
-  };
+  const handleModalClose = () => {};
 
   const handleModalSave = () => {
killedBy: AddToScheduleModal opens and closes the modal
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Add to Schedule</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BooleanLiteral
main/components/PersonalSchedules/AddToScheduleModal.js:28:18
   // Stryker restore all
 
   const handleModalClose = () => {
-    setShowModal(false);
+    setShowModal(true);
   };
 
killedBy: AddToScheduleModal opens and closes the modal
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Add to Schedule</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BlockStatement
main/components/PersonalSchedules/AddToScheduleModal.js:31:33
     setShowModal(false);
   };
 
-  const handleModalSave = () => {
-    onAdd(section, selectedSchedule);
-    handleModalClose();
-  };
+  const handleModalSave = () => {};
 
   //filter schedules to match the current quarter
killedBy: AddToScheduleModal calls onAdd when save is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
