[Killed] BlockStatement
main/components/Sections/SectionsTable.js:31:16
     (section) => section.section.enrollCode === enrollCode,
   );
 
-  if (section) {
-    // Extract the courseId and section number from the found section
-    const courseId = section.courseInfo.courseId;
-    const sectionNumber = section.section.section;
-
-    // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    }
-  }
+  if (section) {}
 
   return false;
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:37:35
     const sectionNumber = section.section.section;
 
     // Check if the section number is '0100', indicating a lecture
-    if (sectionNumber === "0100") {
-      // Filter all sections with the same courseId
-      // Stryker disable all
-      const courseSections = sections.filter(
-        (section) => section.courseInfo.courseId === courseId,
-      );
-      // Stryker restore all
-      // Check if there is only one section for the course
-      return courseSections.length === 1;
-    }
+    if (sectionNumber === "0100") {}
   }
 
killedBy: isLectureWithNoSections should return true when the section is a lecture with no other sections
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:54:10
 
 export const objectToAxiosParams = (data) => {
   return {
-    url: "/api/courses/post",
+    url: "",
     method: "POST",
     params: {
killedBy: objectToAxiosParams should return the correct axios parameters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -2,7 +2,7 @@
    "method": "POST",
    "params": Object {

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:65:21
 
 export const handleAddToSchedule = (section, schedule, mutation) => {
   // Execute the mutation with the provided data
-  const dataFinal = {
-    enrollCd: section.section.enrollCode,
-    psId: schedule,
-  };
+  const dataFinal = {};
   mutation.mutate(dataFinal);
 };
killedBy: handleAddToSchedule calls mutate with correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "enrollCd": "123",
-   "psId": "456",

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:83:40
   mutation.mutate(dataFinal);
 };
 
-export const onSuccess = (response) => {
-  toast(
-    `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
-  );
-};
+export const onSuccess = (response) => {};
 
 export default function SectionsTable({ sections }) {
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New course Created - id: 1 enrollCd: 1234"

Number of calls: 0

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:85:5
 
 export const onSuccess = (response) => {
   toast(
-    `New course Created - id: ${response[0].id} enrollCd: ${response[0].enrollCd}`,
+    ``,
   );
 };
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New course Created - id: 1 enrollCd: 1234"
Received: ""

Number of calls: 1

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:114:17
     },
     {
       Header: "Course ID",
-      accessor: "courseInfo.courseId",
+      accessor: "",
 
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/Sections/SectionsTable.js:116:13
       Header: "Course ID",
       accessor: "courseInfo.courseId",
 
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
+      Cell: () => undefined,
     },
     {
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:118:5
 
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
     },
-    {
-      Header: "Title",
-      accessor: "courseInfo.title",
-      disableGroupBy: true,
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
killedBy: Section Searches Index Page tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:133:5
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "isSection",
     },
-    {
-      Header: "Status",
-      accessor: (row) => formatStatus(row.section),
-      disableGroupBy: true,
-      id: "status",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Enrolled",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:142:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Enrolled",
-      accessor: (row) =>
-        convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
-      disableGroupBy: true,
-      id: "enrolled",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Location",
killedBy: Section tests calls onSuccess when mutation is successful and calls toast with correct parameters
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Sections/SectionsTable.js:192:57
       Header: "Enroll Code",
       accessor: "section.enrollCode",
       disableGroupBy: true,
-      Cell: ({ cell: { value }, row: { original } }) => {
-        // Stryker disable all : difficult to test modal interaction
-        /* istanbul ignore next : difficult to test modal interaction*/
-        if (isSection(original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <span>{value}</span>
-              <AddToScheduleModal
-                quarter={original.courseInfo.quarter}
-                section={original}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return value;
-        }
-        // Stryker restore all
-      },
+      Cell: ({ cell: { value }, row: { original } }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => /* istanbul ignore next */ {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
