[Killed] StringLiteral
main/components/PersonalSchedules/PersonalScheduleSelector.js:11:11
   setSchedule,
   controlId,
   onChange = null,
-  label = "Schedule",
+  label = "",
 }) => {
   const [scheduleState, setScheduleState] = useState(schedule);
killedBy: PersonalScheduleSelector updates the schedule state and calls setSchedule when a schedule is selected
statusReason: TestingLibraryElementError: Unable to find a label with the text of: Schedule

<body>
  <div>
    <div>
      <label
        class="form-label"
        for="controlId"

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.js:15:19
 }) => {
   const [scheduleState, setScheduleState] = useState(schedule);
 
-  useEffect(() => {
-    if (filteredSchedules && filteredSchedules.length > 0) {
-      setSchedule(filteredSchedules[0].id);
-    }
-  }, [filteredSchedules, setSchedule]);
+  useEffect(() => {}, [filteredSchedules, setSchedule]);
 
   const handleScheduleOnChange = (event) => {
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:9
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteredSchedules && filteredSchedules.length > 0) {
+    if (false) {
       setSchedule(filteredSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "schedule1"

Number of calls: 0

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:16:30
   const [scheduleState, setScheduleState] = useState(schedule);
 
   useEffect(() => {
-    if (filteredSchedules && filteredSchedules.length > 0) {
+    if (filteredSchedules && true) {
       setSchedule(filteredSchedules[0].id);
     }
killedBy: PersonalScheduleSelector sets the initial schedule when schedules are loaded
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.js:21:45
     }
   }, [filteredSchedules, setSchedule]);
 
-  const handleScheduleOnChange = (event) => {
-    const selectedSchedule = event.target.value;
-    localStorage.setItem(controlId, selectedSchedule);
-    setScheduleState(selectedSchedule);
-    setSchedule(selectedSchedule);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleScheduleOnChange = (event) => {};
 
   return (
killedBy: PersonalScheduleSelector updates the schedule state and calls setSchedule when a schedule is selected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "schedule1"
Received: null

[Killed] BlockStatement
main/components/PersonalSchedules/PersonalScheduleSelector.js:26:27
     localStorage.setItem(controlId, selectedSchedule);
     setScheduleState(selectedSchedule);
     setSchedule(selectedSchedule);
-    if (onChange != null) {
-      onChange(event);
-    }
+    if (onChange != null) {}
   };
 
killedBy: PersonalScheduleSelector updates the schedule state, calls setSchedule, and calls onChange when a schedule is selected
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:26:9
     localStorage.setItem(controlId, selectedSchedule);
     setScheduleState(selectedSchedule);
     setSchedule(selectedSchedule);
-    if (onChange != null) {
+    if (onChange == null) {
       onChange(event);
     }
killedBy: PersonalScheduleSelector updates the schedule state and calls setSchedule when a schedule is selected
statusReason: TypeError: onChange is not a function

[Killed] LogicalOperator
main/components/PersonalSchedules/PersonalScheduleSelector.js:39:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteredSchedules &&
-          filteredSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {filteredSchedules || filteredSchedules.map(schedule => <option key={schedule.id} value={schedule.id}>
+              {yyyyqToQyy(schedule.quarter)} {schedule.name}
+            </option>)}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the filtered schedule prop if matching quarters
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, quarter, name}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/PersonalSchedules/PersonalScheduleSelector.js:39:10
         value={scheduleState}
         onChange={handleScheduleOnChange}
       >
-        {filteredSchedules &&
-          filteredSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+        {true}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the filtered schedule prop if matching quarters
statusReason: TestingLibraryElementError: Unable to find an element with the display value: F22 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >

[Killed] ArrowFunction
main/components/PersonalSchedules/PersonalScheduleSelector.js:40:33
         onChange={handleScheduleOnChange}
       >
         {filteredSchedules &&
-          filteredSchedules.map((schedule) => (
-            <option key={schedule.id} value={schedule.id}>
-              {yyyyqToQyy(schedule.quarter)} {schedule.name}
-            </option>
-          ))}
+          filteredSchedules.map(() => undefined)}
       </Form.Control>
     </Form.Group>
killedBy: PersonalScheduleSelector sets the initial schedule from the filtered schedule prop if matching quarters
statusReason: TestingLibraryElementError: Unable to find an element with the display value: F22 Schedule 1.

<body>
  <div>
    <div>
      <label
        class="form-label"
      >
