[Killed] BlockStatement
src/main/utils/PersonalScheduleUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/personalschedules",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export function filterSchedulesByQuarter(schedules, quarter) {
killedBy: PersonalSchedulesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "PersonalSchedule with id 1 was deleted"
Received: "useBackendMutation: Error communicating with backend via get on undefined"

Number of calls: 1

<html>

[Killed] BlockStatement
src/main/utils/PersonalScheduleUtils.js:18:62
   };
 }
 
-export function filterSchedulesByQuarter(schedules, quarter) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
-}
+export function filterSchedulesByQuarter(schedules, quarter) {}
 
killedBy: PersonalScheduleUtils filterSchedulesByQuarter It filters schedules by quarter
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"id": 1, "name": "Schedule 1", "quarter": "20221"}]
Received: undefined

[Killed] ConditionalExpression
src/main/utils/PersonalScheduleUtils.js:19:41
 }
 
 export function filterSchedulesByQuarter(schedules, quarter) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
+  return schedules.filter((schedule) => false);
 }
 
killedBy: PersonalScheduleUtils filterSchedulesByQuarter It filters schedules by quarter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Array [
-   Object {
-     "id": 1,

[Killed] ConditionalExpression
src/main/utils/PersonalScheduleUtils.js:19:41
 }
 
 export function filterSchedulesByQuarter(schedules, quarter) {
-  return schedules.filter((schedule) => schedule.quarter === quarter);
+  return schedules.filter((schedule) => true);
 }
 
killedBy: PersonalScheduleUtils filterSchedulesByQuarter It filters schedules by quarter
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 5

@@ -2,6 +2,11 @@
    Object {
      "id": 1,
