[Killed] BlockStatement
main/components/Jobs/UploadGradeDataJobForm.js:5:35
 
 const UploadGradeDataJobForm = ({ callback }) => {
 
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
killedBy: AdminJobsPage tests user can submit the update grade data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
