[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:37:58
 
   // ***** update courses job *******
 
-  const objectToAxiosParamsUpdateCoursesJob = (data) => ({
-    url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesJob = (data) => ({});
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:47:72
     method: "POST",
   });
 
-  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
-    url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({});
 
   // ***** upload grades job *******
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:49:13
 
   const objectToAxiosParamsUpdateCoursesByQuarterRangeJob = (data) => ({
     url: `/api/jobs/launch/updateCoursesRangeOfQuarters?start_quarterYYYYQ=${data.startQuarter}&end_quarterYYYYQ=${data.endQuarter}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:53:49
   });
 
   // ***** upload grades job *******
-  const objectToAxiosParamsUploadGradeDataJob = () => ({
-    url: `/api/jobs/launch/uploadGradeData`,
-    method: "POST",
-  });
+  const objectToAxiosParamsUploadGradeDataJob = () => undefined;
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update grade data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:55:13
   // ***** upload grades job *******
   const objectToAxiosParamsUploadGradeDataJob = () => ({
     url: `/api/jobs/launch/uploadGradeData`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit the update grade data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/AdminJobsPage.js:95:52
     updateCoursesByQuarterRangeJobMutation.mutate(data);
   };
 
-  const submitUploadGradeDataJob = async (data) => {
-    uploadGradeDataMutation.mutate(data);
-  };
+  const submitUploadGradeDataJob = async (data) => {};
 
   // Stryker disable all
killedBy: AdminJobsPage tests user can submit the update grade data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:120:5
       name: "Test Job",
       form: <TestJobForm submitAction={submitTestJob} />,
     },
-    {
-      name: "Update Courses Database",
-      form: <UpdateCoursesJobForm callback={submitUpdateCoursesJob} />,
-    },
+    {},
     {
       name: "Update Courses Database by quarter",
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Courses Database. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:136:5
       name: "Update Course Database by quarter range for one subject",
       form: <JobComingSoon />,
     },
-    {
-      name: "Update Courses Database by quarter range",
-      form: (
-        <UpdateCoursesByQuarterRangeJobForm
-          callback={submitUpdateCoursesByQuarterRangeJob}
-        />
-      ),
-    },
+    {},
     {
       name: "Update Grade Info",
killedBy: AdminJobsPage tests user can submit the update course data by quarter range job
statusReason: Error: Unable to find an element with the text: Update Courses Database by quarter range. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
