[Killed] BlockStatement
main/pages/CourseDetails/CourseDetailsIndexPage.js:59:32
   );
 
   // Stryker restore all
-  if (gradeData === undefined) {
-    gradeData = [];
-  }
+  if (gradeData === undefined) {}
 
   return (
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsIndexPage.js:59:7
   );
 
   // Stryker restore all
-  if (gradeData === undefined) {
+  if (true) {
     gradeData = [];
   }
killedBy: Course Details Index Page tests Calls Course Grade Distribution api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob Test1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrayDeclaration
main/pages/CourseDetails/CourseDetailsIndexPage.js:60:17
 
   // Stryker restore all
   if (gradeData === undefined) {
-    gradeData = [];
+    gradeData = ["Stryker was here"];
   }
 
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TypeError: Cannot read properties of undefined (reading 'charAt')

[Killed] LogicalOperator
main/pages/CourseDetails/CourseDetailsIndexPage.js:66:10
   return (
     <BasicLayout>
       <div className="pt-2">
-        {moreDetails && moreDetails.courseId && (
+        {moreDetails || moreDetails.courseId && (
           <h5>
             Course Details for {moreDetails.courseId} {yyyyqToQyy(qtr)}
killedBy: Course Details Index Page tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'courseId')

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsIndexPage.js:66:10
   return (
     <BasicLayout>
       <div className="pt-2">
-        {moreDetails && moreDetails.courseId && (
-          <h5>
-            Course Details for {moreDetails.courseId} {yyyyqToQyy(qtr)}
-          </h5>
-        )}
+        {false}
 
         {moreDetails && <CourseDetailsTable details={[moreDetails]} />}
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course Details for CHEM 184 W22. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsIndexPage.js:72:10
           </h5>
         )}
 
-        {moreDetails && <CourseDetailsTable details={[moreDetails]} />}
+        {true}
         {moreDetails && <CourseDescriptionTable course={moreDetails} />}
         {moreDetails ? (
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enroll Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsIndexPage.js:72:10
           </h5>
         )}
 
-        {moreDetails && <CourseDetailsTable details={[moreDetails]} />}
+        {false}
         {moreDetails && <CourseDescriptionTable course={moreDetails} />}
         {moreDetails ? (
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enroll Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsIndexPage.js:73:10
         )}
 
         {moreDetails && <CourseDetailsTable details={[moreDetails]} />}
-        {moreDetails && <CourseDescriptionTable course={moreDetails} />}
+        {true}
         {moreDetails ? (
           <Fragment>
killedBy: Course Details Index Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Course Description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/CourseDetails/CourseDetailsIndexPage.js:73:10
         )}
 
         {moreDetails && <CourseDetailsTable details={[moreDetails]} />}
-        {moreDetails && <CourseDescriptionTable course={moreDetails} />}
+        {moreDetails || <CourseDescriptionTable course={moreDetails} />}
         {moreDetails ? (
           <Fragment>
killedBy: Course Details Index Page tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'description')
