[Killed] BlockStatement
src/main/utils/CoursesUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/courses/user",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 // Example: courseId="CMPSC     130A     " => { subjectArea: "CMPSC", courseNumber: "130A" }
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/courses/user"}
Received: undefined

[Killed] BlockStatement
src/main/utils/CoursesUtils.js:19:41
 }
 
 // Example: courseId="CMPSC     130A     " => { subjectArea: "CMPSC", courseNumber: "130A" }
-export function parseCourseId(courseId) {
-  const splitCourseId = courseId.split(" ").filter((x) => x.length > 0);
-  return {
-    subjectArea: splitCourseId[0],
-    courseNumber: splitCourseId[1],
-  };
-}
+export function parseCourseId(courseId) {}
 
killedBy: CoursesUtils parseCourseId tests
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"courseNumber": "130A", "subjectArea": "CMPSC"}
Received: undefined

[Killed] EqualityOperator
src/main/utils/CoursesUtils.js:20:59
 
 // Example: courseId="CMPSC     130A     " => { subjectArea: "CMPSC", courseNumber: "130A" }
 export function parseCourseId(courseId) {
-  const splitCourseId = courseId.split(" ").filter((x) => x.length > 0);
+  const splitCourseId = courseId.split(" ").filter((x) => x.length >= 0);
   return {
     subjectArea: splitCourseId[0],
killedBy: Course Details Index Page tests Calls Course Grade Distribution api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob Test1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] EqualityOperator
src/main/utils/CoursesUtils.js:20:59
 
 // Example: courseId="CMPSC     130A     " => { subjectArea: "CMPSC", courseNumber: "130A" }
 export function parseCourseId(courseId) {
-  const splitCourseId = courseId.split(" ").filter((x) => x.length > 0);
+  const splitCourseId = courseId.split(" ").filter((x) => x.length <= 0);
   return {
     subjectArea: splitCourseId[0],
killedBy: Course Details Index Page tests Calls Course Grade Distribution api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element with the text: Bob Test1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
